Autodesk.Revit.DB.XYZ.ToString
Gets formatted string showing (X, Y, Z) with values formatted to 9 decimal places.

Autodesk.Revit.DB.XYZ.AngleOnPlaneTo(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Returns the angle between this vector and the specified vector projected to the specified plane.
right: The specified vector.
normal: The normal vector that defines the plane.
Returns: The real number between 0 and 2*PI equal to the projected angle between the two vectors.
Remarks:
The angle is projected onto the plane orthogonal to the specified normal vector,
counterclockwise with the normal pointing upwards.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when right or normal is null.

Autodesk.Revit.DB.XYZ.AngleTo(Autodesk.Revit.DB.XYZ)
Returns the angle between this vector and the specified vector.
source: The specified vector.
Returns: The real number between 0 and PI equal to the angle between the two vectors in radians..
Remarks:
The angle between the two vectors is measured in the plane spanned by them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.DistanceTo(Autodesk.Revit.DB.XYZ)
Returns the distance from this point to the specified point.
source: The specified point.
Returns: The real number equal to the distance between the two points.
Remarks:
The distance between the two points is equal to the length of the vector
that joins the two points.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.IsAlmostEqualTo(Autodesk.Revit.DB.XYZ,System.Double)
Determines whether 2 vectors are the same within the given tolerance.
Remarks: This routine uses an input tolerance to compare two vectors to see if they are almost equivalent. Because it is
comparing two vectors the tolerance value is not in length units but instead represents the variation in direction
between the vectors.  For very small tolerance values it should also be possible to compare two points
with this method.  To compute the distance between two points for a comparison with a larger allowable difference, use
Autodesk.Revit.DB.XYZ.DistanceTo(Autodesk.Revit.DB.XYZ).
source: The vector to compare with this vector.
tolerance: The tolerance for equality check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when tolerance is less than 0.
Returns: True if the vectors are the same; otherwise, false.

Autodesk.Revit.DB.XYZ.IsAlmostEqualTo(Autodesk.Revit.DB.XYZ)
Determines whether this vector and the specified vector are the same within the tolerance (1.0e-09).
Remarks: This routine uses Revit's default tolerance to compare two vectors to see if they are almost equivalent.
Because the tolerance is small enough this can also be used to compare two points.
source: The vector to compare with this vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Returns: True if the vectors are the same; otherwise, false.

Autodesk.Revit.DB.XYZ.Divide(System.Double)
Divides this vector by the specified value and returns the result.
value: The value to divide this vector by.
Returns: The divided vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number or zero.
Remarks:
The divided vector is obtained by dividing each coordinate of
this vector by the specified value.

Autodesk.Revit.DB.XYZ.Multiply(System.Double)
Multiplies this vector by the specified value and returns the result.
value: The value to multiply with this vector.
Returns: The multiplied vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
this vector by the specified value.

Autodesk.Revit.DB.XYZ.Negate
Negates this vector.
Returns: The vector opposite to this vector.
Remarks:
The negated vector is obtained by changing the sign of each coordinate
of this vector.

Autodesk.Revit.DB.XYZ.Subtract(Autodesk.Revit.DB.XYZ)
Subtracts the specified vector from this vector and returns the result.
source: The vector to subtract from this vector.
Returns: The vector equal to the difference between the two vectors.
Remarks:
The subtracted vector is obtained by subtracting each coordinate of
the specified vector from the corresponding coordinate of this vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.Add(Autodesk.Revit.DB.XYZ)
Adds the specified vector to this vector and returns the result.
source: The vector to add to this vector.
Returns: The vector equal to the sum of the two vectors.
Remarks:
The added vector is obtained by adding each coordinate of the specified vector
to the corresponding coordinate of this vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.TripleProduct(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
The triple product of this vector and the two specified vectors.
middle: The second vector.
right: The third vector.
Returns: The real number equal to the triple product.
Remarks:
The scalar triple product is defined as the dot product of one of the vectors
with the cross product of the other two. Geometrically, this product is the (signed)
volume of the parallelepiped formed by the three vectors given.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when middle or right is null.

Autodesk.Revit.DB.XYZ.CrossProduct(Autodesk.Revit.DB.XYZ)
The cross product of this vector and the specified vector.
source: The vector to multiply with this vector.
Returns: The vector equal to the cross product.
Remarks:
The cross product is defined as the vector which is perpendicular to both vectors
with a magnitude equal to the area of the parallelogram they span.
Also known as vector product or outer product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.DotProduct(Autodesk.Revit.DB.XYZ)
The dot product of this vector and the specified vector.
source: The vector to multiply with this vector.
Returns: The real number equal to the dot product.
Remarks:
The dot product is the sum of the respective coordinates of the two vectors:
Vx*Wx + Vy*Wy + Vz*Wz. Also known as scalar product or inner product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.op_Division(Autodesk.Revit.DB.XYZ,System.Double)
Divides the specified vector by the specified value.
left: The value to divide the vector by.
value: The vector to divide by the value.
Returns: The divided vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number or zero.
Remarks:
The divided vector is obtained by dividing each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.XYZ.op_Multiply(Autodesk.Revit.DB.XYZ,System.Double)
Multiplies the specified number and the specified vector.
left: The vector to multiply with the value.
value: The value to multiply with the specified vector.
Returns: The multiplied vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.XYZ.op_Multiply(System.Double,Autodesk.Revit.DB.XYZ)
Multiplies the specified number and the specified vector.
value: The value to multiply with the specified vector.
right: The vector to multiply with the value.
Returns: The multiplied vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when right is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified value is an infinite number.
Remarks:
The multiplied vector is obtained by multiplying each coordinate of
the specified vector by the specified value.

Autodesk.Revit.DB.XYZ.op_UnaryNegation(Autodesk.Revit.DB.XYZ)
Negates the specified vector and returns the result.
Returns: The vector opposite to the specified vector.
Remarks:
The negated vector is obtained by changing the sign of each coordinate
of the specified vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when source is null.

Autodesk.Revit.DB.XYZ.op_Subtraction(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Subtracts the two specified vectors and returns the result.
left: The first vector.
right: The second vector.
Returns: The vector equal to the difference between the two source vectors.
Remarks:
The subtracted vector is obtained by subtracting each coordinate of
the right vector from the corresponding coordinate of the left vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left or right is null.

Autodesk.Revit.DB.XYZ.op_Addition(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Adds the two specified vectors and returns the result.
left: The first vector.
right: The second vector.
Returns: The vector equal to the sum of the two source vectors.
Remarks:
The added vector is obtained by adding each coordinate of the right vector
to the corresponding coordinate of the left vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when left or right is null.

Autodesk.Revit.DB.XYZ.GetLength
Gets the length of this vector.
Remarks:
In 3-D Euclidean space, the length of the vector is the square root of the sum
of the three coordinates squared.

Autodesk.Revit.DB.XYZ.Normalize
Returns a new XYZ whose coordinates are the normalized values from this vector.
Remarks:
Normalized indicates that the length of this vector equals one (a unit vector).
Returns: The normalized XYZ or zero if the vector is almost Zero.

Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ)
Validates that the input point is within Revit design limits.
point: The point to test.
Returns: True if the input point is within Revit design limits, false otherwise.
Remarks:
Used to validate input for geometry construction methods.

Autodesk.Revit.DB.XYZ.IsUnitLength
The boolean value that indicates whether this vector is of unit length.
Remarks:
A unit length vector has a length of one, and is considered normalized.

Autodesk.Revit.DB.XYZ.IsZeroLength
The boolean value that indicates whether this vector is a zero vector.
Remarks: The zero vector's each component is zero within the tolerance (1.0e-09).

Autodesk.Revit.DB.XYZ.BasisZ
The basis of the Z axis.
Remarks: The basis of the Z axis is the vector (0,0,1), the unit vector on the Z axis.

Autodesk.Revit.DB.XYZ.BasisY
The basis of the Y axis.
Remarks: The basis of the Y axis is the vector (0,1,0), the unit vector on the Y axis.

Autodesk.Revit.DB.XYZ.BasisX
The basis of the X axis.
Remarks: The basis of the X axis is the vector (1,0,0), the unit vector on the X axis.

Autodesk.Revit.DB.XYZ.Zero
The coordinate origin or zero vector.
Remarks: The zero vector is (0,0,0).

Autodesk.Revit.DB.XYZ.default(System.Int32)
Indexed access to coordinates.
idx: Use 0 for X, 1 for Y and 2 for Z.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when an attempt is made to access the coordinate
with an index that is larger than 2.

Autodesk.Revit.DB.XYZ.Z
Gets the third coordinate.

Autodesk.Revit.DB.XYZ.Y
Gets the second coordinate.

Autodesk.Revit.DB.XYZ.X
Gets the first coordinate.

Autodesk.Revit.DB.XYZ.#ctor(System.Double,System.Double,System.Double)
Creates an XYZ with the supplied coordinates.
x: The first coordinate.
y: The second coordinate.
z: The third coordinate.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when setting an infinite number to the X, Y or Z property.

Autodesk.Revit.DB.XYZ.#ctor
Creates a default XYZ with the values (0, 0, 0).

Autodesk.Revit.DB.XYZ
Object representing coordinates in 3-dimensional space.
Remarks: Usually this means a point or a vector in 3-dimensional space, depending on the actual use.